{"class_name": "Model", "config": {"name": "model_5", "layers": [{"name": "input_img", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 80, 3], "dtype": "float32", "sparse": false, "name": "input_img"}, "inbound_nodes": []}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_img", 0, 0, {}]]]}, {"name": "leaky_re_lu_25", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "average_pooling2d_27", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_27", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["input_img", 0, 0, {}]]]}, {"name": "Merge_C1_In", "class_name": "Concatenate", "config": {"name": "Merge_C1_In", "trainable": true, "axis": -1}, "inbound_nodes": [[["average_pooling2d_27", 0, 0, {}], ["leaky_re_lu_25", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "filters": 32, "kernel_size": [2, 2], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Merge_C1_In", 0, 0, {}]]]}, {"name": "leaky_re_lu_26", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_26", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "filters": 32, "kernel_size": [2, 2], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}]]]}, {"name": "average_pooling2d_28", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_28", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling2d_27", 0, 0, {}]]]}, {"name": "leaky_re_lu_27", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_27", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "Merge_C3_IN", "class_name": "Concatenate", "config": {"name": "Merge_C3_IN", "trainable": true, "axis": -1}, "inbound_nodes": [[["average_pooling2d_28", 0, 0, {}], ["leaky_re_lu_27", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Merge_C3_IN", 0, 0, {}]]]}, {"name": "average_pooling2d_29", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_29", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling2d_28", 0, 0, {}]]]}, {"name": "leaky_re_lu_28", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_28", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "Merge_C4_IN", "class_name": "Concatenate", "config": {"name": "Merge_C4_IN", "trainable": true, "axis": -1}, "inbound_nodes": [[["average_pooling2d_29", 0, 0, {}], ["leaky_re_lu_28", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "filters": 32, "kernel_size": [6, 6], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Merge_C4_IN", 0, 0, {}]]]}, {"name": "average_pooling2d_25", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_25", "trainable": true, "pool_size": [7, 7], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]]}, {"name": "leaky_re_lu_29", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_29", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "average_pooling2d_26", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_26", "trainable": true, "pool_size": [8, 8], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling2d_25", 0, 0, {}]]]}, {"name": "average_pooling2d_30", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_30", "trainable": true, "pool_size": [8, 8], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_29", 0, 0, {}]]]}, {"name": "dropout_13", "class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["average_pooling2d_26", 0, 0, {}]]]}, {"name": "dropout_14", "class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "rate": 0.0, "noise_shape": null, "seed": null}, "inbound_nodes": [[["average_pooling2d_30", 0, 0, {}]]]}, {"name": "Mergerd_Layer", "class_name": "Concatenate", "config": {"name": "Mergerd_Layer", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_13", 0, 0, {}], ["dropout_14", 0, 0, {}]]]}, {"name": "flatten_5", "class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["Mergerd_Layer", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_30", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_30", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "dropout_15", "class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["leaky_re_lu_30", 0, 0, {}]]]}, {"name": "Output_Layer", "class_name": "Dense", "config": {"name": "Output_Layer", "trainable": true, "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}], "input_layers": [["input_img", 0, 0]], "output_layers": [["Output_Layer", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}